In [2]:
import pandas as pd

print(pd.__name__)

pandas

In [3]:
import pandas as pd

def create_medications(names, counts):
    # Создаем Series с индексами names и значениями counts
    medications = pd.Series(counts, index=names)
    return medications

def get_percent(medications, name):
    # Вычисляем общее количество товаров
    total_count = medications.sum()
    
    # Получаем количество товара с именем name
    item_count = medications.get(name, 0)  # Если товара нет, возвращаем 0
    
    # Вычисляем долю в процентах
    percent = (item_count / total_count) * 100
    return percent

names=['chlorhexidine', 'cyntomycin', 'afobazol']
counts=[15, 18, 7]
medications = create_medications(names, counts)

print(get_percent(medications, "chlorhexidine")) #37.5

37.5

In [10]:
import pandas as pd

def create_companyDF(income, expenses, years):
    # Создаем DataFrame из входных данных
    df = pd.DataFrame({
        'Income': income,
        'Expenses': expenses
    }, index=years)
    return df

def get_profit(df, year):
    # Проверяем, есть ли год в индексе DataFrame
    if year in df.index:
        # Возвращаем разницу между доходом и расходом за указанный год
        return df.loc[year, 'Income'] - df.loc[year, 'Expenses']
    else:
        # Если год отсутствует, возвращаем None
        return None
    
    
income = [478, 512, 196]
expenses = [156, 130, 270]
years = [2018, 2019, 2020]


df = create_companyDF(income, expenses, years)
print(get_profit(df, 2018))
print(df)

322
      Income  Expenses
2018     478       156
2019     512       130
2020     196       270

In [21]:
import pandas as pd
melb_data = pd.read_csv('data/melb_data.csv', sep=',')
# Достаем значение по индексу строки и столбца
value1 = melb_data.iloc[3521, 14]  # Строка 1, столбец 2 (индексация с 0)
#print(value1)  # Вывод: 8
value2 = melb_data.iloc[1690, 14]  # Строка 1, столбец 2 (индексация с 0)
#print(value2)  # Вывод: 8
#print(value1/value2)

#Выведем первые пять строк нашей таблицы: 
display(melb_data.head())
#Следующий код выведет семь последних строк нашей таблицы:
melb_data.tail(7)
#получение информации о форме (размерность таблицы)
melb_data.shape
#Получение информации о столбцах
melb_data.info()


#Изменение типа данных в столбце
melb_data['Car'] = melb_data['Car'].astype('int64')
melb_data['Bedroom'] = melb_data['Bedroom'].astype('int64')
melb_data['Bathroom'] = melb_data['Bathroom'].astype('int64')
melb_data['Propertycount'] = melb_data['Propertycount'].astype('int64')
melb_data['YearBuilt'] = melb_data['YearBuilt'].astype('int64')
melb_data.info()

,index,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,...,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount,Coordinates
0,0,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,...,1.0,202.0,126.0,1970.0,Yarra,-37.7996,144.9984,Northern Metropolitan,4019.0,"-37.7996, 144.9984"
1,1,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,...,0.0,156.0,79.0,1900.0,Yarra,-37.8079,144.9934,Northern Metropolitan,4019.0,"-37.8079, 144.9934"
2,2,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,...,0.0,134.0,150.0,1900.0,Yarra,-37.8093,144.9944,Northern Metropolitan,4019.0,"-37.8093, 144.9944"
3,3,Abbotsford,40 Federation La,3,h,850000.0,PI,Biggin,4/03/2017,2.5,...,1.0,94.0,126.0,1970.0,Yarra,-37.7969,144.9969,Northern Metropolitan,4019.0,"-37.7969, 144.9969"
4,4,Abbotsford,55a Park St,4,h,1600000.0,VB,Nelson,4/06/2016,2.5,...,2.0,120.0,142.0,2014.0,Yarra,-37.8072,144.9941,Northern Metropolitan,4019.0,"-37.8072, 144.9941"

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13580 entries, 0 to 13579
Data columns (total 23 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   index          13580 non-null  int64
 1   Suburb         13580 non-null  object
 2   Address        13580 non-null  object
 3   Rooms          13580 non-null  int64
 4   Type           13580 non-null  object
 5   Price          13580 non-null  float64
 6   Method         13580 non-null  object
 7   SellerG        13580 non-null  object
 8   Date           13580 non-null  object
 9   Distance       13580 non-null  float64
 10  Postcode       13580 non-null  int64
 11  Bedroom        13580 non-null  float64
 12  Bathroom       13580 non-null  float64
 13  Car            13580 non-null  float64
 14  Landsize       13580 non-null  float64
 15  BuildingArea   13580 non-null  float64
 16  YearBuilt      13580 non-null  float64
 17  CouncilArea    12211 non-null  object
 18  Lattitude      13580 non-null  float64
 19  Longtitude     13580 non-null  float64
 20  Regionname     13580 non-null  object
 21  Propertycount  13580 non-null  float64
 22  Coordinates    13580 non-null  object
dtypes: float64(11), int64(3), object(9)
memory usage: 2.4+ MB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13580 entries, 0 to 13579
Data columns (total 23 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   index          13580 non-null  int64
 1   Suburb         13580 non-null  object
 2   Address        13580 non-null  object
 3   Rooms          13580 non-null  int64
 4   Type           13580 non-null  object
 5   Price          13580 non-null  float64
 6   Method         13580 non-null  object
 7   SellerG        13580 non-null  object
 8   Date           13580 non-null  object
 9   Distance       13580 non-null  float64
 10  Postcode       13580 non-null  int64
 11  Bedroom        13580 non-null  int64
 12  Bathroom       13580 non-null  int64
 13  Car            13580 non-null  int64
 14  Landsize       13580 non-null  float64
 15  BuildingArea   13580 non-null  float64
 16  YearBuilt      13580 non-null  int64
 17  CouncilArea    12211 non-null  object
 18  Lattitude      13580 non-null  float64
 19  Longtitude     13580 non-null  float64
 20  Regionname     13580 non-null  object
 21  Propertycount  13580 non-null  int64
 22  Coordinates    13580 non-null  object
dtypes: float64(6), int64(8), object(9)
memory usage: 2.4+ MB

In [22]:
melb_data.describe().loc[:, ['Distance', 'BuildingArea' , 'Price']]

           Distance  BuildingArea         Price
count  13580.000000  13580.000000  1.358000e+04
mean      10.137776    139.633972  1.075684e+06
std        5.868725    392.217403  6.393107e+05
min        0.000000      0.000000  8.500000e+04
25%        6.100000    122.000000  6.500000e+05
50%        9.200000    126.000000  9.030000e+05
75%       13.000000    129.940000  1.330000e+06
max       48.100000  44515.000000  9.000000e+06

In [24]:
'''
Например, для типа данных object метод describe() возвращает DataFrame, в котором указаны:

количество непустых строк (count);
количество уникальных значений (unique);
самое частое значение — мода —  (top);
частота — объём использования — этого значения (freq) для каждого столбца типа object исходной таблицы.
'''

melb_data.describe(include=['object'])

,Suburb,Address,Type,Method,SellerG,Date,CouncilArea,Regionname,Coordinates
count,13580,13580,13580,13580,13580,13580,12211,13580,13580
unique,314,13378,3,5,268,58,33,8,13097
top,Reservoir,13 Robinson St,h,S,Nelson,27/05/2017,Moreland,Southern Metropolitan,"-37.8361, 144.9966"
freq,359,3,9449,9022,1565,473,1163,4695,12

In [26]:
# → Для того чтобы определить, сколько раз в столбце повторяется каждый из вариантов значений (т.е. найти частоту для каждого уникального знания), используется метод value_counts().

melb_data['Regionname'].value_counts()
'''
Чтобы сделать вывод более интерпретируемым и понятным, можно воспользоваться параметром normalize. При установке значения этого параметра на True результат будет представляться в виде доли (относительной частоты):
'''

melb_data['Regionname'].value_counts(normalize=True)

Regionname
Southern Metropolitan         0.345729
Northern Metropolitan         0.286451
Western Metropolitan          0.217084
Eastern Metropolitan          0.108321
South-Eastern Metropolitan    0.033137
Eastern Victoria              0.003903
Northern Victoria             0.003019
Western Victoria              0.002356
Name: proportion, dtype: float64

In [28]:
import pandas as pd
import numpy as np

# Создаем DataFrame с пропущенными значениями


# Считаем пропущенные значения в столбце 'CouncilArea'
missing_values = melb_data['CouncilArea'].isna().sum()

print(f"Количество пропущенных значений в столбце 'CouncilArea': {missing_values}")

Количество пропущенных значений в столбце 'CouncilArea': 1369

In [30]:
# Выбираем столбцы с целочисленным типом данных
integer_columns = melb_data.select_dtypes(include=['int', 'int64'])

# Считаем количество таких столбцов
num_integer_columns = integer_columns.shape[1]
print(num_integer_columns)

8

In [42]:
# Сколько процентов от общего количества домов составляют таунхаусы (тип объекта — t)?
# Ответ округлите до целого числа. Не указывайте знак %.
melb_data['Type'].value_counts(normalize=True)

median_area = melb_data['BuildingArea'].median()
mean_area = melb_data['BuildingArea'].mean()
print("median -",median_area )
print("mean -", mean_area)

deviation_percent = ((median_area - mean_area) / mean_area) * 100
print (deviation_percent)

median - 126.0
mean - 139.63397229013256
-9.764079662364534

In [43]:
import statistics

# Заданный ряд чисел
data = [1, 2, 4, 2, 3, 2, 1, 5, 6]

# Находим моду
mode_value = statistics.mode(data)

print(f"Мода ряда: {mode_value}")

Мода ряда: 2

In [50]:
often_bedrooms = melb_data['Bedroom'].mode()
melb_data.tail(7)

melb_data['Address'].value_counts(normalize=True)

Address
13 Robinson St      0.000221
5 Margaret St       0.000221
2 Bruce St          0.000221
36 Aberfeldie St    0.000221
14 Arthur St        0.000221
                      ...
33 Moonstone Cct    0.000074
4 Collegian Av      0.000074
31 Barkly St        0.000074
7 Fullbrook Dr      0.000074
37 Ligar St         0.000074
Name: proportion, Length: 13378, dtype: float64

In [54]:
mask = melb_data['Price'] > 2000000

display(melb_data[mask].head())

melb_data[melb_data['Price'] > 2000000]

# Найдём количество зданий с тремя комнатами. Для этого отфильтруем таблицу по условию: обратимся к результирующей таблице по столбцу Rooms и найдём число строк в ней с помощью атрибута shape:
melb_data[melb_data['Rooms'] == 3].shape[0]

,index,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,...,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount,Coordinates
80,80,Albert Park,112 Beaconsfield Pde,3,h,2850000.0,PI,Buxton,4/03/2017,3.3,...,0,211.0,198.0,1890,Port Phillip,-37.8481,144.9499,Southern Metropolitan,3280,"-37.8481, 144.9499"
85,85,Albert Park,104 Richardson St,4,h,2300000.0,S,Marshall,7/05/2016,3.3,...,1,153.0,180.0,1880,Port Phillip,-37.8447,144.9523,Southern Metropolitan,3280,"-37.8447, 144.9523"
88,88,Albert Park,29 Faussett St,2,h,2120000.0,S,Greg,10/09/2016,3.3,...,1,199.0,107.0,1900,Port Phillip,-37.8422,144.9554,Southern Metropolitan,3280,"-37.8422, 144.9554"
92,92,Albert Park,2 Dundas Pl,3,h,2615000.0,S,Cayzer,10/12/2016,3.3,...,1,177.0,181.0,1880,Port Phillip,-37.8415,144.9585,Southern Metropolitan,3280,"-37.8415, 144.9585"
93,93,Albert Park,23 Finlay St,5,h,2100000.0,S,Greg,10/12/2016,3.3,...,1,237.0,126.0,1970,Port Phillip,-37.8436,144.9557,Southern Metropolitan,3280,"-37.8436, 144.9557"

5881

In [60]:
melb_data[melb_data['Bathroom'] == 0].shape[0]

34

In [64]:
# Сколько в таблице melb_data объектов недвижимости, которые были проданы риелторской компанией Nelson и стоимость которых составила больше 3 миллионов?


melb_data[(melb_data['SellerG'] == 'Nelson') & (melb_data['Price'] > 3000000)].shape[0]

5

In [93]:
# Какова минимальная стоимость участка без здания (площадь здания равна 0) в таблице melb_data?




# Фильтруем строки, где BuildingArea == 0
filtered_data = melb_data[melb_data['BuildingArea'] == 0]

# Находим строку с минимальной ценой
min_price_row = filtered_data.loc[filtered_data['Price'].idxmin()]


min_price_row['Price']
# Выводим результат
#print(min_price_row)

np.float64(412500.0)

In [101]:
# Какова средняя цена объектов недвижимости в таблице melb_data с ценой менее одного миллиона, в которых либо количество комнат больше пяти, либо здание моложе 2015 года?

filtered_datap = melb_data[(melb_data['Price'] < 1000000)]
filtered_data = filtered_datap[(filtered_datap['Rooms'] > 5) | (filtered_datap['YearBuilt'] > 2015)]



filtered_data['Price'].mean()




# Находим строку с минимальной ценой
#min_price_row = filtered_data.loc[filtered_data['Price'].idxmin()]


#min_price_row['Price']

np.float64(769238.6363636364)

In [102]:
#В каком районе Мельбурна чаще всего продаются виллы и коттеджи (тип здания — h) с ценой меньше трёх миллионов
filtered_data = melb_data[(melb_data['Type'] == 'h') & (melb_data['Price'] < 3000000)]

filtered_data['Regionname'].value_counts(normalize=True)

Regionname
Northern Metropolitan         0.296855
Southern Metropolitan         0.273319
Western Metropolitan          0.247939
Eastern Metropolitan          0.126573
South-Eastern Metropolitan    0.041974
Eastern Victoria              0.005423
Northern Victoria             0.004447
Western Victoria              0.003471
Name: proportion, dtype: float64

In [110]:
#Информация о столбцах таблицы:
import pandas as pd
student_data = pd.read_csv('data/students_performance.csv', sep=',')
student_data.head()
student_data.shape

(1000, 8)

In [111]:
student_data.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [115]:
#Каков балл по письму у студента под индексом 155?

# Номер строки
row_index = 155

# Имя столбца
column_name = 'writing score'

# Получаем значение
value = student_data.loc[row_index, column_name]
print(f"Значение в строке {row_index} и столбце '{column_name}': {value}")

Значение в строке 155 и столбце 'writing score': 88

In [118]:
# Считаем пропущенные значения только в столбцах 'Age' и 'Grade'
missing_in_age_grade = student_data.isna().sum().sum()
print(f"Пропущенные значения в столбцах : {missing_in_age_grade}")

Пропущенные значения в столбцах : 0

In [119]:
#Сколько столбцов в таблице имеет тип данных object?
# Выбираем столбцы с типом object
object_columns = student_data.select_dtypes(include=['object'])

# Считаем количество таких столбцов
num_object_columns = object_columns.shape[1]

print(f"Количество столбцов с типом object: {num_object_columns}")

Количество столбцов с типом object: 5

In [125]:
#Какой объём памяти (в килобайтах) занимает таблица?

# Получаем объём памяти для каждого столбца (в байтах)
student_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [120]:
#Каков у студентов средний балл по математике?

mean_math_score = student_data['math score'].mean()

print("mean math score -",mean_math_score )

mean math score - 66.089

In [121]:
#Какая расовая группа является самой крупной в учебном заведении?
student_data['race/ethnicity'].value_counts(normalize=True)

race/ethnicity
group C    0.319
group D    0.262
group B    0.190
group E    0.140
group A    0.089
Name: proportion, dtype: float64

In [132]:
#student_data['test preparation course'] = student_data['TestPreparationCourse'].astype('object')
student_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [131]:
#Каков средний балл по чтению у студентов, которые посещали курсы подготовки к экзаменам?
filtered_data = student_data[(student_data['test preparation course'] == 'completed')]
mean_reading_score = filtered_data['reading score'].mean()
print("mean reading score -",mean_reading_score )

mean reading score - 73.89385474860335

In [138]:
#Сколько студентов получили 0 баллов по математике?
filtered_data = student_data[(student_data['math score'] == 0)]

filtered_data.shape[0]
#Получение информации о столбцах
#student_data.info()

1

In [142]:
student_data.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [144]:
# Проверьте гипотезу: у студентов с оплачиваемым питанием средний балл по математике выше, чем у студентов с льготным питанием.
# В качестве ответа напишите наибольший средний балл по математике среди этих групп студентов.
student_data.head()


filtered_data_l= student_data[(student_data['lunch'] == 'standard')]
mean_lstd = filtered_data_l['math score'].mean()
print("mean lstd -",mean_lstd )


filtered_data_lr= student_data[(student_data['lunch'] == 'free/reduced')]
mean_lrstd = filtered_data_lr['math score'].mean()
print("mean lrstd -",mean_lrstd )

mean lstd - 70.03410852713178
mean lrstd - 58.92112676056338

In [147]:
#Каков процент студентов, родители которых имеют высшее образование уровня бакалавриата (bachelor's degree)?




filtered_data_lr= student_data[(student_data['parental level of education'] == "bachelor's degree")]
mean_lrstd = filtered_data_lr['math score'].mean()
print("mean lrstd -",mean_lrstd )


student_data['parental level of education'].value_counts(normalize=True)

mean lrstd - 69.38983050847457

parental level of education
some college          0.226
associate's degree    0.222
high school           0.196
some high school      0.179
bachelor's degree     0.118
master's degree       0.059
Name: proportion, dtype: float64

In [150]:
# Насколько медианный балл по письму у студентов в расовой группе А отличается от среднего балла по письму у студентов в расовой группе C?
# Округлите ответ до целого и запишите модуль этого числа.


# Фильтруем данные для групп A и C
group_a = student_data[student_data['race/ethnicity'] == 'group A']
group_c = student_data[student_data['race/ethnicity'] == 'group C']

# Вычисляем медиану для группы A
median_group_a = group_a['writing score'].median()
print("median group-a -",median_group_a )
# Вычисляем среднее для группы C
mean_group_c = group_c['writing score'].mean()
print("mean group-c -",mean_group_c )


# Находим разницу и округляем до целого
difference = abs(round(median_group_a - mean_group_c))

print(f"Медиана группы A: {median_group_a}")
print(f"Среднее группы C: {mean_group_c}")
print(f"Разница: {difference}")

median group-a - 62.0
mean group-c - 67.82758620689656
Медиана группы A: 62.0
Среднее группы C: 67.82758620689656
Разница: 6